root-2.3.0/run/PenetrationFOAM/test/0/epsilon.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    aeration
    {
        type            fixedValue;
        value           $internalField;
    }
    xsides
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    zsides
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    semiConductor1
    {
        type            zeroGradient;
    }
    semiConductor1-shadow
    {
        type            zeroGradient;
    }
    semiConductor2
    {
        type            zeroGradient;
    }
    semiConductor2-shadow2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
