root-2.3.0/run/PenetrationFOAM/test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    aeration
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           $internalField;
    }
    xsides
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    zsides
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    semiConductor1
    {
        type            zeroGradient;
    }
    semiConductor1-shadow
    {
        type            zeroGradient;
    }
    semiConductor2
    {
        type            zeroGradient;
    }
    semiConductor2-shadow2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
