root-2.3.0/run/PenetrationFOAM/test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    aeration
    {
        type            patch;
        nFaces          100;
        startFace       2650;
    }
    xsides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2750;
    }
    zsides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       2850;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       3250;
    }
)

// ************************************************************************* //
